Repository: GWY0309/my-diary
Catalog: lib/l10n/app_*.arb
Languages: fil

# appTitle
source: My Diary
fil: Ang Aking Talaarawan

source: Settings
fil: Mga Setting

source: Dark Mode
fil: Madilim na Mode

source: Login
fil: Mag-login

source: Logout
fil: Mag-logout

source: App Lock
fil: Lock ng App

# deleteSuccess
source: Delete successful
fil: Matagumpay na natanggal

source: Filter by Tag
fil: I-filter ayon sa Tag

# tagLife
source: Life
fil: Buhay

# tagWork
source: Work
fil: Trabaho

# tagTravel
source: Travel
fil: Paglalakbay

# tagFood
source: Food
fil: Pagkain

# tagStudy
source: Study
fil: Pag-aaral

# tapAgainToExit
source: Tap again to exit My Diary
fil: I-tap muli upang lumabas

source: Selected
fil: Napili

# searchHint
source: Search diaries...
fil: Maghanap ng mga talaarawan...

source: No diaries found
fil: Walang natagpuang talaarawan

# logoutConfirmation
source: Are you sure you want to logout? You will need to login again next time.
fil: Sigurado ka bang gusto mong mag-logout? Kailangan mong mag-login muli sa susunod.

source: Cancel
fil: Kanselahin

# confirmLogout
source: Logout
fil: Mag-logout

# appearanceAndExperience
source: Appearance & Experience
fil: Hitsura at Karanasan

# privacyAndSecurity
source: Privacy & Security
fil: Pagkapribado at Seguridad

# enablePinFirst
source: Enable PIN lock first
fil: Paganahin muna ang PIN lock

# pleaseEnablePinFirst
source: Please enable PIN lock first
fil: Mangyaring paganahin muna ang PIN lock

# biometricNotSupported
source: Biometric not supported or enabled
fil: Hindi suportado o hindi paganahin ang biometrics

# enterEmailAndPassword
source: Please enter email and password
fil: Mangyaring ilagay ang email at password

source: Forgot Password?
fil: Nakalimutan ang Password?

# loginButton
source: Login
fil: Mag-login

# noAccount
source: Don't have an account?
fil: Wala pang account?

source: Register Now
fil: Magrehistro Ngayon

# registerTitle
source: Register
fil: Magrehistro

# confirmPasswordLabel
source: Confirm Password
fil: Kumpirmahin ang Password

source: Passwords do not match
fil: Hindi magkatugma ang mga password

# registerSuccess
source: Registration successful
fil: Matagumpay na pagpaparehistro

# registerFailed
source: Registration failed: {error}
fil: Nabigo ang pagpaparehistro: {error}

# newDiaryTitle
source: New Diary
fil: Bagong Talaarawan

# editDiaryTitle
source: Edit Diary
fil: I-edit ang Talaarawan

# saveButton
source: Save
fil: I-save

# titleHint
source: Title
fil: Pamagat

# contentHint
source: Write something today...
fil: Sumulat ng tungkol sa araw na ito...

# tagsLabel
source: Tags
fil: Mga Tag

source: Select Date
fil: Pumili ng Petsa

source: Please enter content
fil: Mangyaring maglagay ng nilalaman

# diaryDetailTitle
source: Diary Detail
fil: Detalye ng Talaarawan

# editAction
source: Edit
fil: I-edit

# deleteAction
source: Delete
fil: Tanggalin

# shareAction
source: Share
fil: Ibahagi

# statisticsTitle
source: Statistics
fil: Mga Istatistika

# moodChartTitle
source: Mood Trend
fil: Trend ng Mood

# diaryCountTitle
source: Total Diaries
fil: Kabuuang Talaarawan

source: Mood Distribution
fil: Pamamahagi ng Mood

# enterPinTitle
source: Enter PIN
fil: Ilagay ang PIN

# setPinTitle
source: Set PIN
fil: Itakda ang PIN

# confirmPinTitle
source: Confirm PIN
fil: Kumpirmahin ang PIN

# pinIncorrect
source: Incorrect PIN
fil: Maling PIN

# pinNotMatch
source: PINs do not match
fil: Hindi magkatugma ang mga PIN

# pinSetSuccess
source: PIN set successfully
fil: Matagumpay na naitakda ang PIN

# unlockTitle
source: Unlock App
fil: I-unlock ang App

# weatherLabel
source: Weather
fil: Panahon

# weatherSunny
source: Sunny
fil: Maaraw

# weatherCloudy
source: Cloudy
fil: Maulap

# weatherRainy
source: Rainy
fil: Maulan

# weatherSnowy
source: Snowy
fil: Maniyebe

# weatherThunder
source: Thunder
fil: May Kulog

# weatherWindy
source: Windy
fil: Mahangin

source: Language
fil: Wika

source: Select Language
fil: Pumili ng Wika
